`main.tf`

```hcl
provider "scaleway" {
  region       = "fr-par"
  zone         = "fr-par-1"
}

locals {
  server_count  = "1"
  type          = "DEV-1S"
  project_name  = "mytest"
  env           = "prod"
  server_domain = "example.com"
}

resource "scaleway_instance_ip" "server_ip" {
  count   = local.server_count
}

resource "scaleway_instance_ip_reverse_dns" "reverse" {
  count   = local.server_count
  ip_id   = element(scaleway_instance_ip.server_ip.*.id, count.index)
  reverse = element(scaleway_instance_server.server.*.name, count.index)
}

resource "scaleway_instance_security_group" "secgroup" {
  name                    = "${local.project_name}-${local.env}"
  inbound_default_policy  = "drop"
  outbound_default_policy = "accept"

  inbound_rule {
    action = "accept"
    port   = "22"
  }

  inbound_rule {
    action = "accept"
    port   = "80"
  }

  inbound_rule {
    action = "accept"
    port   = "443"
  }
}

resource "scaleway_instance_server" "server" {
  count             = local.server_count
  name              = "${local.project_name}-${format("%02d",count.index + 1)}-${local.env}.${local.server_domain}"
  type              = local.type
  image             = "ubuntu-bionic"

  tags              = ["${local.project_name}", "${local.env}"]

  ip_id             = element(scaleway_instance_ip.server_ip.*.id, count.index)

  security_group_id = scaleway_instance_security_group.secgroup.id

  lifecycle {
    ignore_changes = [image]
  }
}
```

On `terraform plan` not problem is shown.

On `terraform apply` I get:
```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_instance_ip.server_ip[0] will be created
  + resource "scaleway_instance_ip" "server_ip" {
      + address         = (known after apply)
      + id              = (known after apply)
      + organization_id = (known after apply)
      + reverse         = (known after apply)
      + zone            = (known after apply)
    }

  # scaleway_instance_ip_reverse_dns.reverse[0] will be created
  + resource "scaleway_instance_ip_reverse_dns" "reverse" {
      + id      = (known after apply)
      + ip_id   = (known after apply)
      + reverse = "mytest-01-prod.example.com"
      + zone    = (known after apply)
    }

  # scaleway_instance_security_group.secgroup will be created
  + resource "scaleway_instance_security_group" "secgroup" {
      + external_rules          = false
      + id                      = (known after apply)
      + inbound_default_policy  = "drop"
      + name                    = "mytest-prod"
      + organization_id         = (known after apply)
      + outbound_default_policy = "accept"
      + zone                    = (known after apply)

      + inbound_rule {
          + action   = "accept"
          + port     = 22
          + protocol = "TCP"
        }
      + inbound_rule {
          + action   = "accept"
          + port     = 80
          + protocol = "TCP"
        }
      + inbound_rule {
          + action   = "accept"
          + port     = 443
          + protocol = "TCP"
        }
    }

  # scaleway_instance_server.server[0] will be created
  + resource "scaleway_instance_server" "server" {
      + boot_type                        = (known after apply)
      + disable_dynamic_ip               = false
      + disable_public_ip                = false
      + enable_dynamic_ip                = false
      + enable_ipv6                      = false
      + id                               = (known after apply)
      + image                            = "ubuntu-bionic"
      + ip_id                            = (known after apply)
      + ipv6_address                     = (known after apply)
      + ipv6_gateway                     = (known after apply)
      + ipv6_prefix_length               = (known after apply)
      + name                             = "mytest-01-prod.example.com"
      + organization_id                  = (known after apply)
      + placement_group_policy_respected = (known after apply)
      + private_ip                       = (known after apply)
      + public_ip                        = (known after apply)
      + security_group_id                = (known after apply)
      + state                            = "started"
      + tags                             = [
          + "ansible",
          + "prod",
        ]
      + type                             = "DEV-1S"
      + zone                             = (known after apply)

      + root_volume {
          + delete_on_termination = (known after apply)
          + size_in_gb            = (known after apply)
          + volume_id             = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

scaleway_instance_security_group.secgroup: Creating...
scaleway_instance_ip.server_ip[0]: Creating...
scaleway_instance_ip.server_ip[0]: Creation complete after 1s [id=fr-par-1/ce412a14-0b21-4703-a594-7a0ce6c10cc1]
scaleway_instance_security_group.secgroup: Creation complete after 5s [id=fr-par-1/062b201a-6d5b-4d68-82a4-c00abd6b8bbc]
scaleway_instance_server.server[0]: Creating...

Error: invalid image 'ubuntu-bionic': it must be an UUID or a valid image label

  on main.tf line 45, in resource "scaleway_instance_server" "server":
  45: resource "scaleway_instance_server" "server" {
```